Revit 2024 API
BoundingBoxXYZ.Max Property
Maximum coordinates (upper-right-front corner of the box).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Max { get; set; }
Visual Basic
Public Property Max As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Max {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
The bounds are defined in the coordinate space of the box.
See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace